# Quartile and Tukey's Method (IQR) for Outlier Detection.

* Quatiles are value that divide data into four equal parts. These are typically the 25th, 50th(Median), and 75th percentile.

* Tukey's Method used the interquartile range (IQR) to detect outliers. The formula for detecting outliers is:
  * Lower Bound = Q1 - 1.5 * IQR
  * Upper Bound = Q3 + 1.5 * IQR
  * Data points below the lower bound and upper bound are consedered outliers.

In [4]:
import numpy as np
import pandas as pd

In [6]:
df = pd.read_csv("Titanic_dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [11]:
# Calculate Q1, Q3 and IQR 
Q1 = df["Fare"].quantile(0.25)
Q3 = df["Fare"].quantile(0.75)
IQR = Q3 - Q1
IQR

23.6042

In [12]:
# Define outlier thresholds
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

In [15]:
# Detect outliers
outliers = df[(df["Fare"] < lower_bound) | (df['Fare'] > upper_bound)]

print(f"Number of outliers in Fare column :" , len(outliers))

Number of outliers in Fare column : 55

# Explanation

* This method calculated Q1 (25th percentile) and Q3(75th percentile).
* The interqurtile Range (IQR) is computed as IQR = Q3 - Q1.
* Any data point below lower quartile and upper quartile is flaged as an outlier.
* The method is effective for skewed data but may not work well for normally distributed data.